OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf88.h
#define _FOSC_LP                0x3FEC  // LP oscillator.
#define _LP_OSC                 0x3FEC  // LP oscillator.
#define _FOSC_XT                0x3FED  // XT oscillator.
#define _XT_OSC                 0x3FED  // XT oscillator.
#define _FOSC_HS                0x3FEE  // HS oscillator.
#define _HS_OSC                 0x3FEE  // HS oscillator.
#define _FOSC_EC                0x3FEF  // ECIO; port I/O function on RA6/OSC2/CLKO.
#define _EXTCLK                 0x3FEF  // ECIO; port I/O function on RA6/OSC2/CLKO.
#define _FOSC_INTOSCIO          0x3FFC  // INTRC oscillator; port I/O function on both RA6/OSC2/CLKO pin and RA7/OSC1/CLKI pin.
#define _INTRC_IO               0x3FFC  // INTRC oscillator; port I/O function on both RA6/OSC2/CLKO pin and RA7/OSC1/CLKI pin.
#define _FOSC_INTOSCCLK         0x3FFD  // INTRC oscillator; CLKO function on RA6/OSC2/CLKO pin and port I/O function on RA7/OSC1/CLKI pin.
#define _INTRC_CLKOUT           0x3FFD  // INTRC oscillator; CLKO function on RA6/OSC2/CLKO pin and port I/O function on RA7/OSC1/CLKI pin.
#define _FOSC_EXTRCIO           0x3FFE  // EXTRC oscillator; port I/O function on RA6/OSC2/CLKO.
#define _EXTRC_IO               0x3FFE  // EXTRC oscillator; port I/O function on RA6/OSC2/CLKO.
#define _FOSC_EXTRCCLK          0x3FFF  // EXTRC oscillator; CLKO function on RA6/OSC2/CLKO.
#define _EXTRC_CLKOUT           0x3FFF  // EXTRC oscillator; CLKO function on RA6/OSC2/CLKO.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // RA5/MCLR/VPP pin function is digital I/O, MCLR internally tied to VDD.
#define _MCLR_OFF               0x3FDF  // RA5/MCLR/VPP pin function is digital I/O, MCLR internally tied to VDD.
#define _MCLRE_ON               0x3FFF  // RA5/MCLR/VPP pin function is MCLR.
#define _MCLR_ON                0x3FFF  // RA5/MCLR/VPP pin function is MCLR.
#define _BOREN_OFF              0x3FBF  // BOR disabled.
#define _BODEN_OFF              0x3FBF  // BOR disabled.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BODEN_ON               0x3FFF  // BOR enabled.
#define _LVP_OFF                0x3F7F  // RB3 is digital I/O, HV on MCLR must be used for programming.
#define _LVP_ON                 0x3FFF  // RB3/PGM pin has PGM function, Low-Voltage Programming enabled.
#define _CPD_ON                 0x3EFF  // Data EE memory code-protected.
#define _CPD_OFF                0x3FFF  // Code protection off.
#define _WRT_ALL                0x39FF  // 0000h to 0FFFh write-protected.
#define _WRT_PROTECT_ALL        0x39FF  // 0000h to 0FFFh write-protected.
#define _WRT_2048               0x3BFF  // 0000h to 07FFh write-protected, 0800h to 0FFFh may be modified by EECON control.
#define _WRT_PROTECT_2048       0x3BFF  // 0000h to 07FFh write-protected, 0800h to 0FFFh may be modified by EECON control.
#define _WRT_256                0x3DFF  // 0000h to 00FFh write-protected, 0100h to 0FFFh may be modified by EECON control.
#define _WRT_PROTECT_256        0x3DFF  // 0000h to 00FFh write-protected, 0100h to 0FFFh may be modified by EECON control.
#define _WRT_OFF                0x3FFF  // Write protection off.
#define _WRT_PROTECT_OFF        0x3FFF  // Write protection off.
#define _DEBUG_ON               0x37FF  // In-Circuit Debugger enabled, RB6 and RB7 are dedicated to the debugger.
#define _DEBUG_OFF              0x3FFF  // In-Circuit Debugger disabled, RB6 and RB7 are general purpose I/O pins.
#define _CCPMX_RB3              0x2FFF  // CCP1 function on RB3.
#define _CCP1_RB3               0x2FFF  // CCP1 function on RB3.
#define _CCPMX_RB0              0x3FFF  // CCP1 function on RB0.
#define _CCP1_RB0               0x3FFF  // CCP1 function on RB0.
#define _CP_ON                  0x1FFF  // 0000h to 0FFFh code-protected (all protected).
#define _CP_ALL                 0x1FFF  // 0000h to 0FFFh code-protected (all protected).
#define _CP_OFF                 0x3FFF  // Code protection off.

//----------------------------- CONFIG2 Options -------------------------------

#define _FCMEN_OFF              0x3FFE  // Fail-Safe Clock Monitor disabled.
#define _FCMEN_ON               0x3FFF  // Fail-Safe Clock Monitor enabled.
#define _IESO_OFF               0x3FFD  // Internal External Switchover mode disabled.
#define _IESO_ON                0x3FFF  // Internal External Switchover mode enabled.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 2, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 2, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 2, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 2, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 3
#define CHS1                    ADCON0bits.CHS1                 // bit 4
#define CHS2                    ADCON0bits.CHS2                 // bit 5
#define ADCS0                   ADCON0bits.ADCS0                // bit 6
#define ADCS1                   ADCON0bits.ADCS1                // bit 7

#define VCFG0                   ADCON1bits.VCFG0                // bit 4
#define VCFG1                   ADCON1bits.VCFG1                // bit 5
#define ADCS2                   ADCON1bits.ADCS2                // bit 6
#define ADFM                    ADCON1bits.ADFM                 // bit 7

#define ANS0                    ANSELbits.ANS0                  // bit 0
#define ANS1                    ANSELbits.ANS1                  // bit 1
#define ANS2                    ANSELbits.ANS2                  // bit 2
#define ANS3                    ANSELbits.ANS3                  // bit 3
#define ANS4                    ANSELbits.ANS4                  // bit 4
#define ANS5                    ANSELbits.ANS5                  // bit 5
#define ANS6                    ANSELbits.ANS6                  // bit 6

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define CCP1Y                   CCP1CONbits.CCP1Y               // bit 4
#define CCP1X                   CCP1CONbits.CCP1X               // bit 5

